configuration/src/InformationRegisters/ИсторияАктуализацииЗаявокНаРазработку/ИсторияАктуализацииЗаявокНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияАктуализацииЗаявокНаРазработку</name>
  <comment>Хранит историю актуализации заявок: пользовательские и автоматические действия</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Действие</name>
    <comment>Действие над заявкой: 0 - добавлена в список на актуализацию; 1 - актуальность подтверждена пользователем; 2 - заявка отклонена пользователем; 3 - заявка отклонена системой; 4 - пользователь просмотрел информацию о необходимости актуализации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияАктуализацииЗаявокНаРазработку/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр сведений ИсторияАктуализацииЗаявокНаРазработку.
//
// Параметры:
//  Заявка   - ДокументСсылка.ЗаявкаНаРазработку - ссылка на заявку.
//  Действие - Число - действие над заявкой. Расшифровка значений указана в пояснении
//             к регистру сведений и в комментарии к ресурсу Действие.
//
Процедура ДобавитьЗапись(Знач Заявка, Знач Действие) Экспорт
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	НоваяЗапись.Период       = ТекущаяДатаСеанса();
	НоваяЗапись.Заявка       = Заявка;
	НоваяЗапись.Действие     = Действие;
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
